inference/inference-Leonardo/results/vllm/sonnet/Llama-3.1-8B-Instruct/Nodes_2-GPUs_4-TP_8-PP_1/launch-1/logs_benchmarking_400-concurrency.log
INFO 09-15 17:17:06 [__init__.py:244] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='localhost', port=2950, endpoint='/v1/completions', dataset=None, dataset_name='sonnet', dataset_path='/leonardo_scratch/large/userinternal/rscheda0/benchmarks/inference/inference-Leonardo/benchmarks/datasets/sonnet.txt', max_concurrency=400, model='/leonardo_scratch/large/userinternal/rscheda0/models/Llama-3.1-8B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1000, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, metadata=None, result_dir=None, result_filename='/leonardo_scratch/large/userinternal/rscheda0/benchmarks/inference/inference-Leonardo/results/vllm/sonnet/Llama-3.1-8B-Instruct/Nodes_2-GPUs_4-TP_8-PP_1/launch-1/Concurrency_400.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto')
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 400
============ Serving Benchmark Result ============
Successful requests:                     1000      
Benchmark duration (s):                  31.58     
Total input tokens:                      509089    
Total generated tokens:                  150000    
Request throughput (req/s):              31.67     
Output token throughput (tok/s):         4750.05   
Total Token throughput (tok/s):          20871.39  
---------------Time to First Token----------------
Mean TTFT (ms):                          3726.79   
Median TTFT (ms):                        703.10    
P99 TTFT (ms):                           8413.53   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          51.37     
Median TPOT (ms):                        51.94     
P99 TPOT (ms):                           53.72     
---------------Inter-token Latency----------------
Mean ITL (ms):                           51.37     
Median ITL (ms):                         50.91     
P99 ITL (ms):                            82.46     
==================================================